{
    "frontend": [
        {
            "name": "MediCo",
            "subheader": "Project Manager  / Team Lead",
            "description": "Medical consultation web application for remote access to healthcare services with accessibility features for elderly.",
            "icon": "",
            "link": "https://github.com/kk-min/medico",
            "bulletpoints": [
                "Developed a web application with React framework and Javascript and Firebase as backend",
                "Managed a team of 6 developers to ensure timely completion and delivery of project",
                "Designed and implemented application architecture for easy reusability and integration with Firebase's Authentication service",
                "Implemented live chat feature with Firebase's Firestore database"
            ]
        },
        {
            "name": "SGSAFETY - Web Application",
            "subheader": "Team Lead",
            "description": "Promotional website for SGSafety Android mobile application, a distress signal broadcaster and receiver.",
            "icon": "",
            "link": "https://github.com/kk-min/sgsafety-mobile",
            "bulletpoints": [
                "Developed a web application with React framework and Javascript to promote SGSAFETY Android mobile application",
                "Led a team of 6 members through the software development process from planning to deployment",
                "Managed project timeline with Agile framework, delegated tasks to team members for timely completion",
                "Integrated cross-platform authentication via Firebase's Authentication service for both web and mobile",
                "Integrated live AED location map into website via Singapore government’s AED Locations API"
            ]
        },
        {
            "name": "Chat Application Web",
            "subheader": "",
            "description": "Online web application for chatting with Min... if you know the secret!",
            "icon": "",
            "link": "https://github.com/kk-min/chat-application-web",
            "bulletpoints": [
                "Developed a web application with React framework and Javascript",
                "Built responsive UI with Material UI",
                "Integrated Firebase Authentication for secret check",
                "Implemented Firestore database for live chat functinality"
            ]
        },
        {
            "name": "kk-min.github.io",
            "subheader": "",
            "description": "This website!",
            "icon": "",
            "link": "https://github.com/kk-min/kk-min.github.io",
            "bulletpoints": [
                "Developed a web application with React framework, Typescript and CSS",
                "Designed and implemented tab-based content navigation",
                "Designed reusable components from ground up for easy integration into other projects"
            ]
        }
    ],
    "backend": [
        {
            "name": "SGSAFETY - Android Application",
            "subheader": "Team Lead",
            "description": "Android mobile application for broadcasting and receiving distress signals.",
            "icon": "",
            "link": "https://github.com/kk-min/sgsafety-mobile",
            "bulletpoints": [
                "Developed a native Android application in Kotlin with Firebase as remote database",
                "Managed a team of 5 developers to ensure timely completion and delivery of project",
                "Spearheaded application architecture design decisions",
                "Implemented distress signal broadcasting via a distributed computation approach using Firebase Topic Messaging",
                "Implemented live location trail and map view using OpenStreetMaps API"
            ]
        },
        {
            "name": "Android Bluetooth Controller Application",
            "subheader": "Bluetooth Developer",
            "description": "Android mobile application for controlling and communicating with a Raspberry PI via Bluetooth signals.",
            "icon": "",
            "link": "",
            "bulletpoints": [
                "Developed a native Android application in Java to provide Bluetooth communication with a Raspberry PI",
                "Implemented Bluetooth scanning and connection with other devices",
                "Planned and collaborated signal headers and payloads with Raspberry PI developer for varying communication functionalities",
                "Assisted GUI Developer in live display of communication status and received data to GUI",
                "Designed and implemented a 5-attempt Bluetooth reconnection mechanism for consistent and robust connection"
            ]
        },
        {
            "name": "Chat Application Desktop",
            "subheader": "",
            "description": "Desktop Application for chat communication between two clients.",
            "icon": "",
            "link": "https://github.com/kk-min/chat-application-desktop",
            "bulletpoints": [
                "Developed a desktop application in Java and JavaFX",
                "Implemented GUI using JavaFX and Model-View-Controller (MVC) framework",
                "Integrated asnyhronous execution of I/O bound operations for concurrent send/receive operations using Java's CompletableFuture library"
            ]
        },
        {
            "name": "Stock Exchange System",
            "subheader": "",
            "description": "Model of a stock exchange system with price-time order matching.",
            "icon": "",
            "link": "https://github.com/kk-min/stock-exchange-system",
            "bulletpoints": [
                "Developed a console application in Java",
                "Implemented price-time order matching system",
                "Implemented quote history tracking for different stocks",
                "Adhered to best-practice design principles such as Single Responsibility Principle and Dependency Inversion Principle"
            ]
        }
    ],
    "miscellaneous": [
        {
            "name": "Bluetooth Server Tester",
            "subheader": "",
            "description": "Python server-side application for testing client-side Bluetooth functionalities.",
            "icon": "",
            "link": "https://github.com/kk-min/bluetooth-server-tester",
            "bulletpoints": [
                "Developed a Python application with and PyBluez library for sending/receiving Bluetooth messages",
                "Implemented multi-threading for concurrent send/receive operations",
                "Designed and implemented bluetooth reconnection mechanism via polling and automatic connection reinitiation"
            ]
        },
        {
            "name": "Accounting Process and Calculation Automation",
            "subheader": "",
            "description": "Various Python/VBA scripts for automating accounting calculations and processes.",
            "icon": "",
            "link": "",
            "bulletpoints": [
                "Developed various Python and VBA scripts for automating accounting processes and calculations",
                "Designed user interface for easy usability and user onboarding",
                "Implemented Python program to interface with Outlook API for automated file downloading and decryption",
                "Implemented VBA scripts for excel manipulations including custom cross-file data extraction, data validation"
            ]
        }
    ]
}
